pairs = []
for x in range(1, 700):
    for y in range(1, 700):
        pairs.append([x, y])

for a in range(0, 1000):
    for x, y in pairs:
        f = (541241 != (5*x + y)) or (a > x) or (a > y)
        if f == 0:
            break
    else:
        print(a)

# ТОЛЬКО АНАЛИТИЧЕСКОЕ РЕШЕНИЕ (ответ 90207)
# 541241 == (5*x + y)
# 541241 == (5*90205 + 90216)
# 541241 == (5*90206 + 90211) <-  a > x => a = 90207
# 541241 == (5*90207 + 90206) <-  a > y => a = 90207
# 541241 == (5*90208 + 90201)

# b = 541241 // 6 - 1
# print(b)
# print(541241 - b*5)



