from functools import cache

@cache
def g(n):
    if n == 1:
        return 2
    return 3 * g(n-1)

# for i in range(1, 2*10**12 + 10, 800):
#     g(i)
#
# res = g(2*10**12 + 7) // 9**(10**12 + 3)
# print(res)
# здесь очень большие числа и кэш, как и лимит рекурсии, не сработают

for i in range(1, 10):
    print(i, g(i))

# 1 2 = 2 * 3**0
# 2 6 = 2 * 3**1
# 3 18 = 2 * 3**2
# 4 54
# 5 162
# 6 486
# 7 1458
# 8 4374
# 9 13122 = 2 * 3**8
# ....
# g(2*10**12 + 7) = 2 * 3 ** (2*10**12 + 6)
# res = 2 * 3 ** (2*10**12 + 6) // 9**(10**12 + 3)
# res = 2 * 3 ** (2*10**12 + 6) // (3**2)**(10**12 + 3)
# res = 2 * 3 ** (2*10**12 + 6) // (3**(2*(10**12 + 3))
# res = 2 * 3 ** (2*10**12 + 6) // (3**(2*10**12 + 6))
# res = 2
